outputs/openfoam_cases/0003/system/controlDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs ("libRSM.so");

application interFoam;

startFrom       latestTime;

startTime       140;

stopAt          endTime;

endTime         600; //250

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   10; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.05;

maxAlphaCo      0.05;

maxDeltaT       1;

functions
{
  //  #includeIfPresent "../waveGaugesNProbes/surfaceElevationAnyName_controlDict";
}

functions
{
    readZeta
    {
        type            readFields;
        libs            ("libfieldFunctionObjects.so");
        fields          (zeta);

        executeControl  timeStep;
        executeInterval 1;
    }
}

// ************************************************************************* //